<a href="https://colab.research.google.com/github/junxnone/examples/blob/master/pandas/pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

# 构造 DataFrame
- 一维数组，列表，字典或 Series 的字典
- 二维 numpy.ndarray
- 结构化或记录 ndarray
- Series
- 另一个DataFrame

## 字典
- Series 的字典

In [3]:
d = {'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
       'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [4]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [5]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

- ndarrays 的字典

In [6]:
d = {'one' : [1., 2., 3., 4.],
       'two' : [4., 3., 2., 1.]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [7]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

- 来自字典的数组

In [8]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [9]:
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [10]:
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

## numpy

In [19]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
data[:] = [(1,2.,'Hello'), (2,3.,"World")]
pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [20]:
pd.DataFrame(data, index=['first', 'second'])

        A    B         C
first   1  2.0  b'Hello'
second  2  3.0  b'World'

In [40]:
df = pd.DataFrame(data, columns=['C', 'A', 'B'])
print(df)

          C  A    B
0  b'Hello'  1  2.0
1  b'World'  2  3.0

# 操作 DataFrame

In [41]:
df['A']

0    1
1    2
Name: A, dtype: int32

In [42]:
df['D'] = df['A'] + df['B']
df['E'] = df['A'] * df['B']
df

          C  A    B    D    E
0  b'Hello'  1  2.0  3.0  2.0
1  b'World'  2  3.0  5.0  6.0

In [43]:
df['flag'] = df['B'] > 2
df

          C  A    B    D    E   flag
0  b'Hello'  1  2.0  3.0  2.0  False
1  b'World'  2  3.0  5.0  6.0   True

In [50]:
df['foo'] = 'bar'
df['one_trunc'] = df['A'][:1]
df

          C  A    B    D    E   flag  one_trunc  foo
0  b'Hello'  1  2.0  3.0  2.0  False        1.0  bar
1  b'World'  2  3.0  5.0  6.0   True        NaN  bar

In [45]:
df.insert(1, 'bar', df['A'])
df

          C  bar  A    B    D    E   flag  foo  one_trunc
0  b'Hello'    1  1  2.0  3.0  2.0  False  bar        1.0
1  b'World'    2  2  3.0  5.0  6.0   True  bar        NaN

In [46]:
del df['bar']
df

          C  A    B    D    E   flag  foo  one_trunc
0  b'Hello'  1  2.0  3.0  2.0  False  bar        1.0
1  b'World'  2  3.0  5.0  6.0   True  bar        NaN

In [57]:
foo = df.pop('foo')
df

          C  A    B    D    E   flag  one_trunc
0  b'Hello'  1  2.0  3.0  2.0  False        1.0
1  b'World'  2  3.0  5.0  6.0   True        NaN

# csv

In [0]:
df.to_csv('foo.csv')

In [61]:
!cat foo.csv

,C,A,B,D,E,flag,one_trunc
0,b'Hello',1,2.0,3.0,2.0,False,1.0
1,b'World',2,3.0,5.0,6.0,True,

In [92]:
rdf = pd.read_csv('foo.csv')
rdf

   Unnamed: 0         C  A    B    D    E   flag  one_trunc
0           0  b'Hello'  1  2.0  3.0  2.0  False        1.0
1           1  b'World'  2  3.0  5.0  6.0   True        NaN

In [93]:
rdf.drop(rdf.columns[0],axis=1,inplace=True)
rdf

          C  A    B    D    E   flag  one_trunc
0  b'Hello'  1  2.0  3.0  2.0  False        1.0
1  b'World'  2  3.0  5.0  6.0   True        NaN

In [94]:
rdf.T

                  0         1
C          b'Hello'  b'World'
A                 1         2
B                 2         3
D                 3         5
E                 2         6
flag          False      True
one_trunc         1       NaN

In [107]:
rdf.A

0    1
1    2
Name: A, dtype: int64

In [97]:
rdf.loc[:,['A','D']]

   A    D
0  1  3.0
1  2  5.0

In [111]:
rdf.iloc[1,2]

3.0

In [110]:
rdf.iloc[1]

C            b'World'
A                   2
B                   3
D                   5
E                   6
flag             True
one_trunc         NaN
Name: 1, dtype: object